## Learning Outcomes

By the end of this lesson, you should be able to...

1. Merge or combine data from multiple dataframes in Pandas
1. Concatonate a dataframe with another using Pandas

## Combine Dataset in Pandas 

- Create two dataframes that have common columns, say ${\bf x}_1$ is the column they have in common

In [2]:
import pandas as pd

adf = pd.DataFrame(data={'x1': ['A', 'B', 'C'], 'x2' : [1, 2, 3]})

In [2]:
adf

  x1  x2
0  A   1
1  B   2
2  C   3

In [4]:
bdf = pd.DataFrame(data={'x1': ['A', 'B', 'D'], 'x3' : ['T', 'F', 'T']})

In [4]:
bdf

  x1 x3
0  A  T
1  B  F
2  D  T

### Merge adf and bdf based on adf
Documenation for the [merge](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html) method in Pandas

Merge DataFrame or named Series objects with a database-style join. The join is done on columns or indexes.

### how parameter 

left: use only keys from left frame, similar to a SQL left outer join; preserve key order.

right: use only keys from right frame, similar to a SQL right outer join; preserve key order.

outer: use union of keys from both frames, similar to a SQL full outer join; sort keys lexicographically.

inner: use intersection of keys from both frames, similar to a SQL inner join; preserve the order of the left keys.

In [8]:
pd.merge(adf, bdf, how='left')

#There's no C in bdf so corresponding value in merged x3 is NaN

  x1  x2   x3
0  A   1    T
1  B   2    F
2  C   3  NaN

### Merge adf and bdf based on bdf

In [6]:
pd.merge(adf, bdf, how= 'right')

#no D in adf so corresponding value in merged x2 is NaN

  x1   x2 x3
0  A  1.0  T
1  B  2.0  F
2  D  NaN  T

### Merge adf and bdf based on what they have in common

In [11]:
pd.merge(adf, bdf, how= 'inner') #intersection

  x1  x2 x3
0  A   1  T
1  B   2  F

#### Another method for the above task

In [9]:
pd.merge(adf, bdf) #default is inner

  x1  x2 x3
0  A   1  T
1  B   2  F

### Union of merge for adf and bdf

In [9]:
pd.merge(adf, bdf, how= 'outer') #union, NaN spaces where's there's not things in common

  x1   x2   x3
0  A  1.0    T
1  B  2.0    F
2  C  3.0  NaN
3  D  NaN    T

### Concatenating Pandas dataframe

Documentation for the [concat](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html) method in Pandas

Some quick definitions on **row-wise** vs **column-wise** concatenation:

- **Row-wise concatenation**: Tables are concatenated at the rows. We now have a table that's _taller_ than it's width. Think of taking the two dataframes and stacking them on top of each other
- **Column-wise concatenation**: Tables are concatenated at the columns. We now have a table that's _wider_ than it's height. Think of the dataframes as blocks, and you're smashing the blocks together so that the left side of one is next to the right side of the other

In [10]:
# Row-wise concatenation
pd.concat([adf, bdf], sort=True)

  x1   x2   x3
0  A  1.0  NaN
1  B  2.0  NaN
2  C  3.0  NaN
0  A  NaN    T
1  B  NaN    F
2  D  NaN    T

In [19]:
# Column-wise concatenation 
# axis: whether we will concatenate along rows (0) or columns (1)
newdf = pd.concat([adf, bdf], axis=1)

  x1 x1
0  A  A
1  B  B
2  C  D

In [21]:
cdf = pd.DataFrame(data={'x1': ['A', 'B', 'C'], 'x3' : ['T', 'F', 'T']})
# cdf
pd.concat([adf, cdf], axis=1)

  x1  x2 x1 x3
0  A   1  A  T
1  B   2  B  F
2  C   3  C  T

In [22]:
pd.concat([adf, cdf], sort=False)

  x1   x2   x3
0  A  1.0  NaN
1  B  2.0  NaN
2  C  3.0  NaN
0  A  NaN    T
1  B  NaN    F
2  C  NaN    T

### Activity: Correct the indexing after concatenation

In [25]:
# Correct the indexing after concatenation
# ignore_index: whether or not the original row labels from should be retained
df = pd.concat([adf, cdf])
df

  x1   x2   x3
0  A  1.0  NaN
1  B  2.0  NaN
2  C  3.0  NaN
0  A  NaN    T
1  B  NaN    F
2  C  NaN    T

In [26]:
pd.merge(adf, cdf, how='left')

  x1  x2 x3
0  A   1  T
1  B   2  F
2  C   3  T

## When two dataframes have exactly the same columns

Documentation for the [append](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.append.html) method in Pandas

Append rows of other to the end of caller, returning a new object.

Columns in other that are not in the caller are added as new columns.

[Difference between merge, concat, and append](https://www.reddit.com/r/learnpython/comments/6986nd/difference_between_concatenate_append_merge_in/)

In [30]:

df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

df = df.append(df2, ignore_index=True)

In [31]:
df

   a  b
0  1  2
1  3  4
2  5  6
3  7  8

### Slicing dataframe based on the largest value for a specific column

Documentation for the [nlargest](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.nlargest.html) method in Pandas

Return the first n rows ordered by columns in descending order.

In [21]:
import numpy as np

# initialize a dataframe
df = pd.DataFrame({'a': [1, 10, 8, 11, -1],'b': list('abdce'), 'c': [1.0, 2.0, np.nan, 3.0, 4.0]})
df

    a  b    c
0   1  a  1.0
1  10  b  2.0
2   8  d  NaN
3  11  c  3.0
4  -1  e  4.0

In [22]:
# Select the three largest values from column 'a'. 
# Keep only the values in columns 'b' and 'c' that are in the same row as the 3 largest values in 'a'
df.nlargest(3, 'a')

    a  b    c
3  11  c  3.0
1  10  b  2.0
2   8  d  NaN

In [23]:
# calculate the number of null values in column 'c'
df['c'].isnull().sum()

1

In [73]:
# calculate the number of null values in the dataframe
df.isnull().sum()

a    0
b    0
c    1
dtype: int64

### Reshape Pandas dataframe with Melt

While sometimes it's easy for us to read data from a dataframe as a human, it can make it hard to analyze or do operations on. Sometimes in order to perform operations, we need to **reshape** the data first. Reshaping data is a way to restructure how the data is laid out in a dataframe - such as changing what the rows and columns represent - without changing the data itself. 

One way to achieve reshaping is to use the [melt](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.melt.html) method in Pandas. Melt returns a reshaped dataframe based on an input dataframe and values associated to other input parameters. For this example we'll use the following input parameters, but read the [docs on melt](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.melt.html) for more info:

- `id_vars` - The column(s) to use as identifier variables. This column will remain intact. Anything not specified in `id_vars` will become **unpivoted**. 
    - **Unpivot**: transforming multiple column headers into a single variable column, organized into rows. A new column is then created to store their values
- `var_name`- The name to use for the new "variable" column
- `value_name`- The name to use for the new "value" column

Let's go over an example:

In [74]:
# Initialize the data and dataframe
data = {'weekday': ["Monday", "Tuesday", "Wednesday", 
         "Thursday", "Friday", "Saturday", "Sunday"],
        'Person 1': [12, 6, 5, 8, 11, 6, 4],
        'Person 2': [10, 6, 11, 5, 8, 9, 12],
        'Person 3': [8, 5, 7, 3, 7, 11, 15]}
df = pd.DataFrame(data, columns=['weekday',
        'Person 1', 'Person 2', 'Person 3'])

In [75]:
df

     weekday  Person 1  Person 2  Person 3
0     Monday        12        10         8
1    Tuesday         6         6         5
2  Wednesday         5        11         7
3   Thursday         8         5         3
4     Friday        11         8         7
5   Saturday         6         9        11
6     Sunday         4        12        15

In [76]:
# Reshape Pandas Data With Melt
# the current "weekday" column will be our identifier variable
# therefore, "Person1", "Person2" and "Person3" will now all unpivot into rows under a new variable column "Person"
# The original value under "Person#" will now reside in a new value column called "Score"
# Once melted, we'll display the value (Score) for every variable (Person), associating each variable with it's identifier variable (weekday)
melted = pd.melt(df, id_vars=["weekday"], 
                 var_name="Person", value_name="Score")

In [77]:
melted

      weekday    Person  Score
0      Monday  Person 1     12
1     Tuesday  Person 1      6
2   Wednesday  Person 1      5
3    Thursday  Person 1      8
4      Friday  Person 1     11
5    Saturday  Person 1      6
6      Sunday  Person 1      4
7      Monday  Person 2     10
8     Tuesday  Person 2      6
9   Wednesday  Person 2     11
10   Thursday  Person 2      5
11     Friday  Person 2      8
12   Saturday  Person 2      9
13     Sunday  Person 2     12
14     Monday  Person 3      8
15    Tuesday  Person 3      5
16  Wednesday  Person 3      7
17   Thursday  Person 3      3
18     Friday  Person 3      7
19   Saturday  Person 3     11
20     Sunday  Person 3     15

Source for the above example: https://deparkes.co.uk/2016/10/28/reshape-pandas-data-with-melt/

### More Resources

- https://martin-thoma.com/pandas-merge-join-concatenate/

- https://github.com/codebasics/py/blob/master/pandas/11_melt/pandas_melt_tutorial.ipynb